---
type: DuctLiningType
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 3
tags: [revit-api, class]
---

# DuctLiningType

`Autodesk.Revit.DB.Mechanical.DuctLiningType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidRoughness | 2012 | `public bool IsValidRoughness ( double roughness )` |
| Property | Parameter | — | `` |
| Property | Roughness | 2012 | `public double Roughness { get ; set ; }` |